In [10]:
import numpy as np
import pandas as pd
# create dummy data
stuff = {'A':[1,2,3], 'B':[4,np.nan,np.nan], 'C':[7,8,9], 'D':[10,11,12]}
my_df = pd.DataFrame(stuff)
my_df

   A    B  C   D
0  1  4.0  7  10
1  2  NaN  8  11
2  3  NaN  9  12

In [11]:
# drop rows with null data
my_df.dropna()

   A    B  C   D
0  1  4.0  7  10

In [12]:
# drop col with null data
my_df.dropna(axis =1)

   A  C   D
0  1  7  10
1  2  8  11
2  3  9  12

In [13]:
# not permanent, inplace = false
my_df

   A    B  C   D
0  1  4.0  7  10
1  2  NaN  8  11
2  3  NaN  9  12

In [18]:
# more than one? set threshold
my_df.dropna(thresh=2, axis =1)

   A  C   D
0  1  7  10
1  2  8  11
2  3  9  12

In [19]:
# replace thins with fillna()
my_df.fillna(value = 99)

   A     B  C   D
0  1   4.0  7  10
1  2  99.0  8  11
2  3  99.0  9  12

In [22]:
# use math function
my_df.fillna(value=my_df['B'].mean())

   A    B  C   D
0  1  4.0  7  10
1  2  4.0  8  11
2  3  4.0  9  12

In [23]:
# use min/max
my_df.fillna(value = my_df['B'].min())

   A    B  C   D
0  1  4.0  7  10
1  2  4.0  8  11
2  3  4.0  9  12